УТ/src/Catalogs/CRM_Решения/CRM_Решения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_Решения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <comment>Автор решения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВложений</name>
    <comment>Источник вложений</comment>
    <type>
      <types>CatalogRef.CRM_Решения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКатегория</name>
    <comment>Основная категория</comment>
    <type>
      <types>CatalogRef.CRM_КатегорииРешений</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <comment>Проект</comment>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРешения</name>
    <comment>Статус решения</comment>
    <type>
      <types>EnumRef.CRM_СтатусыРешений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопроса</name>
    <comment>Текст вопроса</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопросаHTML</name>
    <comment>Текст вопроса в формате HTML</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНаименованияРешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Категории</name>
    <comment>Категории</comment>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.CRM_КатегорииРешений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответы</name>
    <comment>Ответы</comment>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АвторИзменения</name>
      <comment>Автор изменения</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтвета</name>
      <comment>Вариант ответа</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтветаHTML</name>
      <comment>Вариант ответа в формате HTML</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеОтвета</name>
      <comment>Наименование ответа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОтвета</name>
      <comment>Статус ответа</comment>
      <type>
        <types>EnumRef.CRM_СтатусыРешений</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРассмотрения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРассмотрения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Enums/CRM_СтатусыРешений/CRM_СтатусыРешений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыРешений</name>
  <enumValues>
    <name>Личное</name>
    <comment>Личное</comment>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
    <comment>Черновик</comment>
  </enumValues>
  <enumValues>
    <name>Утверждено</name>
    <comment>Утверждено</comment>
  </enumValues>
  <enumValues>
    <name>Устарело</name>
    <comment>Устарело</comment>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/CRM_РешенияПрисоединенныеФайлы/CRM_РешенияПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_РешенияПрисоединенныеФайлы</name>
  <comment>Присоединенные файлы (Решения базы знаний)</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.CRM_Решения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <comment>Статус извлечения текста - для фонового задания извлечения текста</comment>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДФайлаЭлектронногоПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_Решения/Forms/ФормаБыстрогоОтвета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.СтатусРешения	= Перечисления.CRM_СтатусыРешений.НаРассмотрении;
		Объект.Автор			= Пользователи.ТекущийПользователь();
		СтрОтвета = Объект.Ответы.Добавить();
		СтрОтвета.ИДСтроки = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "_");
		СтрОтвета.СтатусОтвета = Перечисления.CRM_СтатусыРешений.НаРассмотрении;
		
		Параметры.Свойство("Родитель", Объект.Родитель);
		
		Если Параметры.Свойство("ТекстОтвета") Тогда
			Объект.Наименование = Параметры.ТекстОтвета;
			
			СтрОтвета.НаименованиеОтвета = Объект.Наименование;
			Если Не ЗначениеЗаполнено(СтрОтвета.ВариантОтвета) Тогда
				СтрОтвета.ВариантОтвета = Объект.Наименование;
			КонецЕсли;
		КонецЕсли;

		Если Параметры.Свойство("ТекстВопроса") Тогда
			Объект.Наименование = Параметры.ТекстВопроса;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтрОтвета = ТекущийОбъект.Ответы[0];
	
	Если Не ЗначениеЗаполнено(СтрОтвета.ВариантОтвета) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнен текст ответа!'"), , "ВариантОтвета");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Родитель) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнена группа!'"), , "Объект.Родитель");
		Возврат;
	КонецЕсли;
	
	ДокументHTML = Взаимодействия.ПолучитьДокументHTMLИзОбычногоТекста(СтрОтвета.ВариантОтвета);
	СтрОтвета.ВариантОтветаHTML	= Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
	СтрОтвета.НаименованиеОтвета = Объект.Наименование;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_РешенияПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.CRM_РешенияПрисоединенныеФайлы КАК CRM_РешенияПрисоединенныеФайлы
		|ГДЕ
		|	CRM_РешенияПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ЕстьВложения = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если Объект.Ответы.Количество() = 0 Тогда
		Объект.Ответы.Добавить();
	КонецЕсли;
	СтрОтвета = Объект.Ответы[0];
	Если Не ЗначениеЗаполнено(СтрОтвета.ВариантОтвета) Тогда
		СтрОтвета.ВариантОтвета = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Параметры.CRM_КонтекстВызова = "ФормаБыстрыеОтветы" И Не Объект.Ссылка.Пустая() Тогда
		Если ЕстьВложения Тогда
			CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.АРМДиалоги.Удобство.БыстрыеОтветы.ЗаписьНовогоБыстрогоОтветаСФайлами");
		Иначе
			CRM_ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики("CRM_Статистика.АРМДиалоги.Удобство.БыстрыеОтветы.ЗаписьНовогоБыстрогоОтветаБезФайлов");
		КонецЕсли;
		
		Оповестить("ЗаписьНовогоОтветаВБазуЗнаний", Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
